Revit 2027 API
ParameterTypeId.StairstypeRunType Property
 "Run Type": Run Type
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairstypeRunType { get; }
Public Shared ReadOnly Property StairstypeRunType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairstypeRunType {
	ForgeTypeId^ get ();
}
static member StairstypeRunType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace